{
  "recent-posts": [
    {
      "id": 1,
      "title": "Website Landing Page UI UX design in Figma",
      "img": "https://www.figma.com/community/file/1247507046568618203/thumbnail/800?signature=45e1e0d9-9c04-4e6b-bef6-7a1a09215cdc-cover",
      "body": "I want someone to create a website to introduce my busienss in figma. I have the initial design I only want it to be intaractive in figma.I want someone to create a website to introduce my busienss in figma. I have the initial design I only want it to be intaractive in figma.",
      "price": "70$"
    },
    {
      "id": 2,
      "title": "Create e-commerce website for selling clothes",
      "img": "https://www.figma.com/community/file/1242047123011794602/thumbnail/800?signature=dafb9027-756a-422d-aca8-e868259605c6-cover",
      "body": "I need a website for my company to sell different kinds of clothes. I need this website to work mainly on mobile phones.",
      "price": "120$"
    },
    {
      "id": 3,
      "title": "I want to convert figma design to a website",
      "img": "https://www.figma.com/community/file/1247509061717924061/thumbnail/800?signature=8eb4b903-5b4b-4111-8d8f-d22b373b3569-cover",
      "body": "I want to convert a design for my store in figma to react/js. I have a working API, so I only need the frontend",
      "price": "50$"
    },
    {
      "id": 4,
      "title": "Website Landing Page UI UX design in Figma",
      "img": "https://www.figma.com/community/file/1247507046568618203/thumbnail/800?signature=45e1e0d9-9c04-4e6b-bef6-7a1a09215cdc-cover",
      "body": "I want someone to create a website to introduce my busienss in figma. I have the initial design I only want it to be intaractive in figma.",
      "price": "160$"
    },
    {
      "id": 5,
      "title": "Create e-commerce website for selling clothes",
      "img": "https://www.figma.com/community/file/1242047123011794602/thumbnail/800?signature=dafb9027-756a-422d-aca8-e868259605c6-cover",
      "body": "I need a website for my company to sell different kinds of clothes. I need this website to work mainly on mobile phones.",
      "price": "300$"
    }
  ],
  "delivered-posts": [
    {
      "id": 1,
      "title": "Mobile application for pets' health advices",
      "img": "https://www.figma.com/community/file/1249246050937447456/thumbnail/800?signature=56c4b049-0bf3-46c9-a297-47243d586ac3-cover",
      "body": "Create a website that give health advices to pets' owners",
      "price": "150$"
    },
    {
      "id": 2,
      "title": "Design icons set for discord",
      "img": "https://www.figma.com/community/file/1248627030152531064/thumbnail/800?signature=d934d6f1-979b-4a4f-9104-4c5352418a3f-cover",
      "body": "I want a big list of icons to use it in a discord channel. I want them to be original, and I want to see your previous ecperience with designing",
      "price": "120$"
    },
    {
      "id": 3,
      "title": "I want to create a landing page to my startup",
      "img": "https://www.figma.com/community/file/1245581959942941423/thumbnail/800?signature=90f6c59e-5ccf-4d36-9fc9-476d526a1293-cover",
      "body": "I have a startup that is aimed to develop AI services for companies. I want a simple landing page using REACT. We will consider the developer for future work with us.",
      "price": "1500$"
    },
    {
      "id": 4,
      "title": "Website Landing Page UI UX design in Figma",
      "img": "https://www.figma.com/community/file/1247507046568618203/thumbnail/800?signature=45e1e0d9-9c04-4e6b-bef6-7a1a09215cdc-cover",
      "body": "I want someone to create a website to introduce my busienss in figma. I have the initial design I only want it to be intaractive in figma.",
      "price": "160$"
    },
    {
      "id": 5,
      "title": "Create e-commerce website for selling clothes",
      "img": "https://www.figma.com/community/file/1242047123011794602/thumbnail/800?signature=dafb9027-756a-422d-aca8-e868259605c6-cover",
      "body": "I need a website for my company to sell different kinds of clothes. I need this website to work mainly on mobile phones.",
      "price": "300$"
    }
  ],
  "posts": [
    {
      "id": 1,
      "owner": "Ahmad Alhussin",
      "title": "Mobile application for pets' health advices",
      "description": "I am looking for a talented freelancer to develop a mobile application focused on providing health advice for pets. The goal of the application is to help pet owners take better care of their beloved companions by offering valuable guidance and recommendations related to their pets' health and well-being.\nKey Features:\nPet Profile Management: The application should allow users to create and manage profiles for their pets, including essential information such as age, breed, weight, and any pre-existing medical conditions. This information will be used to personalize the health advice provided by the app.\nHealth Tips and Recommendations: The application should offer a wide range of health tips, advice, and recommendations to users. This can include topics like nutrition, exercise, grooming, vaccination schedules, parasite prevention, and common health issues to watch out for. The advice should be easily understandable and accessible to pet owners of all experience levels.\nPush Notifications: The app should incorporate push notifications to provide timely reminders for important health-related tasks such as medication administration, veterinary appointments, and grooming sessions. This feature will help users stay on top of their pets' healthcare routine.\nSymptom Checker: The application should include a symptom checker feature that allows pet owners to input symptoms or behaviors exhibited by their pets. The app should provide preliminary information on possible causes and recommend whether immediate veterinary attention is necessary.\nResource Library: The app should include a comprehensive resource library with articles, videos, and guides related to pet health. This will enable users to access additional information and deepen their understanding of various health topics.\nCommunity and Support: The application should provide a platform for pet owners to connect, share experiences, and seek advice from fellow users. This can include features such as forums, chat rooms, and the ability to interact with veterinary professionals for more specialized guidance.\nThe freelancer should have experience in mobile app development, a strong understanding of user experience design principles, and familiarity with pet health and care. The project will require close collaboration to ensure the app meets the needs of pet owners and delivers an intuitive and informative user experience.\nIf you are passionate about improving the lives of pets and their owners through technology, please submit your proposal with relevant examples of your previous work.",
      "price_range_min": "150$",
      "price_range_max": "200$",
      "deadline": "3 days",
      "tags": [
        "IT",
        "Mobile development",
        "Flutter",
        "Android"
      ]
    },
    {
      "id": 2,
      "owner": "Ivan Ivanov",
      "title": "Create e-commerce website for selling clothes",
      "description": "Project Description: E-commerce Website for Selling Clothes\nWe are seeking a skilled freelancer to develop an e-commerce website specifically designed for selling clothes online. The goal of this project is to create a visually appealing and user-friendly platform that enables customers to browse, select, and purchase clothing items with ease.\nKey Features:\nUser-friendly Interface: The website should have an intuitive and visually appealing interface that allows customers to easily navigate through various clothing categories, filter search results based on their preferences (e.g., size, color, price range), and view detailed product descriptions.\nProduct Catalog: The website should support a robust product catalog system that allows for easy management of clothing items. Each product should have high-quality images, detailed descriptions, available sizes, color options, and pricing information.\nShopping Cart and Checkout: The website should include a shopping cart functionality that enables customers to add items to their cart and proceed to a secure checkout process. The checkout process should be streamlined, allowing customers to enter shipping and payment details efficiently.\nPayment Gateway Integration: The website should integrate a secure payment gateway that supports various payment methods (e.g., credit/debit cards, PayPal). The integration should ensure the security of customer payment information and provide a smooth transaction experience.\nCustomer Accounts: The website should allow customers to create accounts, which will enable them to save their shipping addresses, track order statuses, view order history, and receive personalized recommendations based on their preferences.\nSearch Functionality: The website should have a robust search feature that allows customers to quickly find specific clothing items or narrow down their search using filters. The search results should be accurate and presented in a user-friendly manner.\nResponsive Design: The website should be optimized for various devices, including desktops, laptops, tablets, and mobile phones. It should provide a seamless browsing and shopping experience across different screen sizes.\nSocial Media Integration: The website should include social media integration, allowing customers to share products they like on popular social platforms. This feature will help promote the brand and attract new customers.\nCustomer Reviews and Ratings: The website should incorporate a system for customers to leave reviews and ratings for products they have purchased. This will provide valuable feedback for other customers and build trust in the brand.\nOrder Management: The website should provide an admin panel to manage orders, update order statuses, track inventory, and generate reports. This feature will enable the website owner to efficiently handle the operational aspects of the e-commerce business.\nThe freelancer should have prior experience in developing e-commerce websites, a strong understanding of user experience design, and expertise in implementing secure payment gateways. The ability to create a visually appealing website that aligns with the brand's style and target audience is crucial.\nIf you are passionate about creating an exceptional online shopping experience for customers and have the necessary skills, please submit your proposal with relevant examples of your previous e-commerce website projects.",
      "price_range_min": "500$",
      "price_range_max": "1000$",
      "deadline": "1 week",
      "tags": [
        "IT",
        "Website",
        "MERN",
        "Fullstack",
        "design"
      ]
    },
    {
      "id": 3,
      "owner": "Mike Smith",
      "title": "I want to convert figma design to a website",
      "description": "Project Description: Converting Figma Design to a Website\nWe are seeking a talented freelancer who specializes in front-end web development to convert a Figma design into a fully functional website. The Figma design serves as a visual representation of the desired website layout, user interface elements, and overall aesthetic.\nKey Requirements:\nFigma to HTML/CSS Conversion: The freelancer should possess expertise in converting Figma designs into clean, semantic HTML and CSS code. They should be proficient in translating the design's visual elements, including fonts, colors, spacing, and imagery, into code that accurately represents the original design.\nResponsive and Mobile-Friendly Design: The resulting website should be responsive, adapting seamlessly to different screen sizes and devices. The freelancer should ensure that the design is fluid and optimized for mobile, tablet, and desktop experiences, providing a consistent and user-friendly interface across all devices.\nCross-Browser Compatibility: The website should be compatible with major web browsers, including Chrome, Firefox, Safari, and Edge. The freelancer should thoroughly test the website on different browsers to ensure consistent performance and visual fidelity.\nInteractive Elements and Animations: The Figma design may include interactive elements, such as dropdown menus, sliders, or animated components. The freelancer should possess the skills to implement these interactive features using JavaScript or other relevant technologies, enhancing the user experience as intended in the design.\nAccessibility Considerations: The freelancer should have a good understanding of web accessibility standards and guidelines. They should ensure that the website adheres to accessibility best practices, including proper semantic markup, alternative text for images, and keyboard navigability.\nIntegration of Content Management System (CMS): If desired, the freelancer should be capable of integrating the converted design into a content management system, such as WordPress or Drupal, enabling easy content updates and management by non-technical users.\nOptimization for Performance: The freelancer should prioritize website performance optimization techniques, including optimizing image sizes, minifying CSS and JavaScript files, and utilizing caching mechanisms. The goal is to create a website that loads quickly and provides a smooth user experience.\nAttention to Detail: It is essential that the freelancer pays attention to detail and accurately replicates the Figma design. The resulting website should closely match the design's visual elements, typography, spacing, and alignment.\nThe freelancer should have a strong portfolio that demonstrates their expertise in Figma-to-website conversions, responsive design, and front-end development. They should possess excellent communication skills to collaborate effectively, provide regular updates, and seek clarification on design elements if needed.\nIf you are proficient in Figma, HTML, CSS, and JavaScript, and are excited about bringing a design to life as a fully functional website, please submit your proposal along with examples of your previous work in this area.",
      "price_range_min": "300$",
      "price_range_max": "400$",
      "deadline": "1 day",
      "tags": [
        "Figma",
        "HTML",
        "CSS",
        "Frontend"
      ]
    },
    {
      "id": 4,
      "owner": "Ahmad Alhussin",
      "title": "Mobile application for pets' health advices",
      "description": "I am looking for a talented freelancer to develop a mobile application focused on providing health advice for pets. The goal of the application is to help pet owners take better care of their beloved companions by offering valuable guidance and recommendations related to their pets' health and well-being.\nKey Features:\nPet Profile Management: The application should allow users to create and manage profiles for their pets, including essential information such as age, breed, weight, and any pre-existing medical conditions. This information will be used to personalize the health advice provided by the app.\nHealth Tips and Recommendations: The application should offer a wide range of health tips, advice, and recommendations to users. This can include topics like nutrition, exercise, grooming, vaccination schedules, parasite prevention, and common health issues to watch out for. The advice should be easily understandable and accessible to pet owners of all experience levels.\nPush Notifications: The app should incorporate push notifications to provide timely reminders for important health-related tasks such as medication administration, veterinary appointments, and grooming sessions. This feature will help users stay on top of their pets' healthcare routine.\nSymptom Checker: The application should include a symptom checker feature that allows pet owners to input symptoms or behaviors exhibited by their pets. The app should provide preliminary information on possible causes and recommend whether immediate veterinary attention is necessary.\nResource Library: The app should include a comprehensive resource library with articles, videos, and guides related to pet health. This will enable users to access additional information and deepen their understanding of various health topics.\nCommunity and Support: The application should provide a platform for pet owners to connect, share experiences, and seek advice from fellow users. This can include features such as forums, chat rooms, and the ability to interact with veterinary professionals for more specialized guidance.\nThe freelancer should have experience in mobile app development, a strong understanding of user experience design principles, and familiarity with pet health and care. The project will require close collaboration to ensure the app meets the needs of pet owners and delivers an intuitive and informative user experience.\nIf you are passionate about improving the lives of pets and their owners through technology, please submit your proposal with relevant examples of your previous work.",
      "price_range_min": "150$",
      "price_range_max": "200$",
      "deadline": "3 days",
      "tags": [
        "IT",
        "Mobile development",
        "Flutter",
        "Android"
      ]
    }
  ],
  "tags": [
    {
      "value": "it",
      "label": "IT"
    },
    {
      "value": "css",
      "label": "CSS"
    },
    {
      "value": "html",
      "label": "HTML"
    },
    {
      "value": "js",
      "label": "JavaScript"
    },
    {
      "value": "java",
      "label": "Java"
    },
    {
      "value": "ebay",
      "label": "eBay"
    },
    {
      "value": "ebookdesign",
      "label": "eBook Design"
    },
    {
      "value": "rlang",
      "label": "R programming language"
    },
    {
      "value": "rabbitmq",
      "label": "RabbitMQ"
    },
    {
      "value": "yarn",
      "label": "Yarn"
    },
    {
      "value": "ubuntu",
      "label": "Ubuntu"
    },
    {
      "value": "ui",
      "label": "UI user Interface"
    },
    {
      "value": "oath",
      "label": "OAth"
    },
    {
      "value": "oop",
      "label": "Object Oriented Programming (OOP)"
    },
    {
      "value": "p2p",
      "label": "P2P network"
    },
    {
      "value": "saas",
      "label": "SaaS"
    },
    {
      "value": "fabric-design",
      "label": "Fabric Design"
    },
    {
      "value": "gameart",
      "label": "Game Art"
    },
    {
      "value": "game-development",
      "label": "Game Development"
    },
    {
      "value": "c",
      "label": "C programming language"
    },
    {
      "value": "cpp",
      "label": "C++ programming language"
    },
    {
      "value": "backend",
      "label": "Backend development"
    },
    {
      "value": "frontend",
      "label": "Frontend development"
    },
    {
      "value": "machine-learngin",
      "label": "Machine Learning"
    },
    {
      "value": "react",
      "label": "React Framework"
    },
    {
      "value": "next",
      "label": "Nextjs Framework"
    }
  ]
}